system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true; //false;

// Geometry
geometry
{
    pier
    {
        type searchableCylinder;
        // Computational domain:
        // z = -0.06 ~ 0.05
        // Cylinder is slightly extended beyond the domain.
        point1 (0 0 -0.061);
        point2 (0 0  0.051);
        radius 0.02; // D = 0.04 m
    }

    // Fine region around the pier, including near-bed flow and horseshoe vortex zone
    nearPierFineBox
    {
        type searchableBox;
        //min (-0.10 -0.075 -0.030);
        //max ( 0.10  0.075  0.050);
        min (-0.06 -0.055 -0.015);
        max ( 0.06  0.055  0.050);
    }

    // Fine scour-bed region around expected initial scour hole
    scourBedFineBox
    {
        type searchableBox;
        //min (-0.12 -0.075 -0.020);
        //max ( 0.18  0.075  0.020);
        min (-0.08 -0.060 -0.020);
        max ( 0.14  0.060  0.020);
    }

    // Broader bed refinement region for approach, side acceleration, and near-wake bed
    /*
    bedRefinementBox
    {
        type searchableBox;
        min (-0.30 -0.105 -0.020);
        max ( 0.40  0.105  0.020);
    }
    */
}

// Castellated mesh controls
castellatedMeshControls
{
    maxLocalCells  3000000;
    maxGlobalCells 10000000;

    minRefinementCells 10;
    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 5; //4;

    features
    (
    );

    refinementSurfaces
    {
        pier
        {
            // With 10 mm background:
            // level 3 -> 1.25 mm
            // level 4 -> 0.625 mm
            
            //level (3 4);

            level (2 3);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        nearPierFineBox
        {
            mode inside;
            levels ((1E15 2));
        }

        scourBedFineBox
        {
            mode inside;
            levels ((1E15 3));
        }
/*
        bedRefinementBox
        {
            mode inside;
            levels ((1E15 2));
        }
*/
    }

    // Must be inside the computational region and outside the pier solid.
    locationInMesh (-0.395 0.00 0.025);

    allowFreeStandingZoneFaces true;
}

// Snap controls
snapControls
{
    nSmoothPatch 5; //3;
    tolerance 1.0;
    nSolveIter 30; //20-40
    nRelaxIter 5; //8;
    nFeatureSnapIter 10; //10-20
    // No eMesh file is required because we use implicit feature snapping.
    implicitFeatureSnap true; //false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

// Layer controls
addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.2;
    finalLayerThickness 0.3; // final layer thickness=near cell size*0.3
    //firstLayerThickness --; 
    minThickness 0.1; //total layer thickness<near cell size*0.1; layer 생성안함

    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;

    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;
    nLayerIter 50;
/*
    nRelaxedIter       20;
    writeVTK           false;
    noErrors           false;
    layerRecovery      1;
    growZoneLayers     false;
    projectGrownUp     0.0;
*/
}

// Mesh quality controls
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave  70; //80;

    minVol          1e-13;
    minTetQuality   1e-15; //1e-30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001; //default 0.001
    minFaceWeight   0.02;
    minVolRatio     0.01; //range 0-1, default 0.01
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

// Advanced
debug 0;

mergeTolerance 1e-6;

// ************************************************************************* //
