0_org/tubpropotes/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.89e-06;

boundaryField
{
/*    inletAir
    {
        type            calculated;
        value           uniform 0;
    }*/

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutkRoughWallFunction;
	Ks		uniform 0;
        Cs	        uniform 0.5;
        value           uniform 0;
    }

/*    sideWall
    {
        //type            symmetry;
        type            nutkWallFunction;
        value           uniform 0;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }*/
}


// ************************************************************************* //
